In [90]:
!pip install pandasql

Requirement already satisfied: pandasql in c:\users\allin\appdata\local\programs\python\python39\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\allin\appdata\local\programs\python\python39\lib\site-packages (from pandasql) (1.23.3)
Requirement already satisfied: pandas in c:\users\allin\appdata\local\programs\python\python39\lib\site-packages (from pandasql) (1.5.2)
Requirement already satisfied: sqlalchemy in c:\users\allin\appdata\local\programs\python\python39\lib\site-packages (from pandasql) (1.4.45)
Requirement already satisfied: pytz>=2020.1 in c:\users\allin\appdata\local\programs\python\python39\lib\site-packages (from pandas->pandasql) (2022.6)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\allin\appdata\roaming\python\python39\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\allin\appdata\roaming\python\python39\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\allin\appdata\local\programs\python\python39\lib\site-packages (from sqlalchemy->pandasql) (2.0.1)

WARNING: You are using pip version 21.2.4; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\allin\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [91]:
import pandas as pd
import pandasql as ps

In [92]:
data = pd.read_excel('bank_account_data.xlsx')
data

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age,Date
0,1,0,1739.48,26918.18,12563.93,0,49,NaT
1,2,0,2862.35,23093.67,15457.88,0,39,NaT
2,3,0,2296.66,18037.33,12721.89,0,52,NaT
3,4,1,2880.28,32317.63,7075.03,0,28,2017-04-30
4,5,0,998.27,15110.04,11356.13,0,43,NaT
...,...,...,...,...,...,...,...,...
195,196,0,2215.39,20050.87,11307.01,0,32,NaT
196,197,0,2074.33,22808.68,7880.16,0,27,NaT
197,198,0,1224.07,29926.97,5637.92,0,44,NaT
198,199,0,2617.27,14316.61,9445.28,0,38,NaT
199,200,0,2125.45,25687.52,4559.63,0,56,NaT

Задание 1. Опишите имеющиеся колонки в данных - сделайте аналог describe в pandas для колонок

In [74]:
# Pandas-like column descriptions
sql_query_cust_ID = '''SELECT SUM(Cust_ID), AVG(Cust_ID), COUNT(Cust_ID), MIN(Cust_ID), MAX(Cust_ID) FROM data'''
sql_query_purchase = '''SELECT SUM(Purchase), AVG(Purchase), COUNT(Purchase), MIN(Purchase), MAX(Purchase) FROM data'''
sql_query_cheq_bal = '''SELECT SUM(Cheq_Bal), AVG(Cheq_Bal), COUNT(Cheq_Bal), MIN(Cheq_Bal), MAX(Cheq_Bal) FROM data'''
sql_query_sav_bal = '''SELECT SUM(Cheq_Bal), AVG(Cheq_Bal), COUNT(Cheq_Bal), MIN(Cheq_Bal), MAX(Cheq_Bal) FROM data'''
sql_query_debt_bal = '''SELECT SUM(Debt_Bal), AVG(Debt_Bal), COUNT(Debt_Bal), MIN(Debt_Bal), MAX(Debt_Bal) FROM data'''
sql_query_joint_acct = '''SELECT SUM(Joint_Acct), AVG(Joint_Acct), COUNT(Joint_Acct), MIN(Joint_Acct), MAX(Joint_Acct) FROM data'''
sql_query_age = '''SELECT SUM(Age), AVG(Age), COUNT(Age), MIN(Age), MAX(Age) FROM data'''
sql_query_date = '''SELECT SUM(Date), AVG(Date), COUNT(Date), MIN(Date), MAX(Date) FROM data'''

In [75]:
describe_cust_ID = ps.sqldf(sql_query_cust_ID)
describe_cust_ID

   SUM(Cust_ID)  AVG(Cust_ID)  COUNT(Cust_ID)  MIN(Cust_ID)  MAX(Cust_ID)
0         20100         100.5             200             1           200

In [76]:
describe_purchase = ps.sqldf(sql_query_purchase)
describe_purchase

   SUM(Purchase)  AVG(Purchase)  COUNT(Purchase)  MIN(Purchase)  MAX(Purchase)
0             39          0.195              200              0              1

In [77]:
describe_cheq_bal = ps.sqldf(sql_query_cheq_bal)
describe_cheq_bal

   SUM(Cheq_Bal)  AVG(Cheq_Bal)  COUNT(Cheq_Bal)  MIN(Cheq_Bal)  MAX(Cheq_Bal)
0       429018.7      2145.0935              200         644.31        4437.44

In [78]:
describe_sav_bal = ps.sqldf(sql_query_sav_bal)
describe_sav_bal

   SUM(Cheq_Bal)  AVG(Cheq_Bal)  COUNT(Cheq_Bal)  MIN(Cheq_Bal)  MAX(Cheq_Bal)
0       429018.7      2145.0935              200         644.31        4437.44

In [79]:
describe_debt_bal = ps.sqldf(sql_query_debt_bal)
describe_debt_bal

   SUM(Debt_Bal)  AVG(Debt_Bal)  COUNT(Debt_Bal)  MIN(Debt_Bal)  MAX(Debt_Bal)
0     1727673.92      8638.3696              200            0.0        20559.7

In [80]:
describe_joint_acct = ps.sqldf(sql_query_joint_acct)
describe_joint_acct

,SUM(Joint_Acct),AVG(Joint_Acct),COUNT(Joint_Acct),MIN(Joint_Acct),MAX(Joint_Acct)
0,59,0.295,200,0,1

In [81]:
describe_age = ps.sqldf(sql_query_age)
describe_age

   SUM(Age)  AVG(Age)  COUNT(Age)  MIN(Age)  MAX(Age)
0      7707    38.535         200        18        60

In [82]:
describe_date = ps.sqldf(sql_query_date)
describe_date

,SUM(Date),AVG(Date),COUNT(Date),MIN(Date),MAX(Date)
0,78663.0,2017.0,39,2017-04-01 00:00:00.000000,2017-08-29 00:00:00.000000

Задание 2. Посчитайте совокупный объем средств у клиентов в банке - сумма по всем балансам.

In [118]:
# The total amount of customer funds in the bank
sql_query_sum_bal = ps.sqldf('SELECT Cust_ID, Cheq_Bal + Sav_Bal + Debt_Bal AS Sum_Bal FROM data GROUP BY Cust_ID;')
sql_query_sum_bal

     Cust_ID   Sum_Bal
0          1  41221.59
1          2  41413.90
2          3  33055.88
3          4  42272.94
4          5  27464.44
..       ...       ...
195      196  33573.27
196      197  32763.17
197      198  36788.96
198      199  26379.16
199      200  32372.60

[200 rows x 2 columns]

Задание 3. Выведите только тех клиентов, которые приобрели ипотеку (колонка mortgage).

In [119]:
# Сlients who have purchased puchase
sql_query_puchase = ps.sqldf('SELECT Cust_ID FROM data WHERE Purchase = 1;')
sql_query_puchase

    Cust_ID
0         4
1         6
2         7
3        11
4        13
5        17
6        18
7        20
8        22
9        31
10       36
11       38
12       40
13       41
14       54
15       56
16       59
17       60
18       74
19       76
20       80
21       87
22       91
23       93
24       94
25       97
26      100
27      107
28      111
29      113
30      132
31      146
32      154
33      166
34      169
35      182
36      184
37      185
38      189

Задание 4. Какой совокупный объем средств в среднем у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [120]:
# The total amount of funds on average from customers who purchased a puchase
sql_query_sum_avg_puchase = ps.sqldf('SELECT Purchase, AVG(Cheq_Bal + Sav_Bal + Debt_Bal) AS Mean_sum_bal FROM data GROUP BY Purchase;')
sql_query_sum_avg_puchase

   Purchase  Mean_sum_bal
0         0  32095.885031
1         1  36054.895385

Задание 5. Есть ли разница в среднем по каждому из типов баланса у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [121]:
# Difference in average for each type of balance between customers,
# who have purchased a mortgage and customers who have not purchased it
sql_query_avg_puchase = ps.sqldf('SELECT Purchase, AVG(Cheq_Bal), AVG(Sav_Bal), AVG(Debt_Bal) FROM data GROUP BY Purchase;')
sql_query_avg_puchase

   Purchase  AVG(Cheq_Bal)  AVG(Sav_Bal)  AVG(Debt_Bal)
0         0    1996.631366  20257.209814    9842.043851
1         1    2757.975641  29627.564359    3669.355385

Задание 6. Выберите самого возрастного получателя ипотеки.

In [122]:
# The oldest mortgage purchase
sql_query_max_age = ps.sqldf('SELECT Cust_ID, MAX(age) FROM data WHERE Purchase = 1;')
sql_query_max_age

   Cust_ID  MAX(age)
0       41        45

Задание 7. Выберите клиента, который раньше всех получил ипотеку.

In [123]:
# The client who received the purchase first
sql_query_min_date = ps.sqldf('SELECT Cust_ID, MIN(date) FROM data WHERE Purchase = 1;')
sql_query_min_date

   Cust_ID                   MIN(date)
0      185  2017-04-01 00:00:00.000000

Задание 8. Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)

In [230]:
# Database consisting of 5 columns, one of the columns is REAL type
import sqlite3

conn = sqlite3.connect('bank_branches.db')

conn.execute('''
CREATE TABLE bank_branches(id INTEGER, 
name STRING, 
opening_date DATE, 
city STRING,
finance REAL);''')

conn.commit()
conn.close()

In [229]:
conn = sqlite3.connect('bank_branches.db')

conn.execute('''
DROP TABLE bank_branches;''')

conn.commit()

conn.close()

In [231]:
conn = sqlite3.connect('bank_branches.db')
cur = conn.cursor()
cur.execute("SELECT * from bank_branches;")
result = cur.fetchall()
conn.close()

result

[]

Задание 9. Добавьте 3 полностью заполненные строки в вашу БД.

In [232]:
# 3 fully filled rows in the database
conn = sqlite3.connect('bank_branches.db')
conn.execute("INSERT INTO bank_branches VALUES ('13', 'BoG', '2020-09-20', 'tbilisi', '65874436.84');")
conn.execute("INSERT INTO bank_branches VALUES ('15', 'TBC', '2020-11-06', 'tbilisi', '54780839.54');")
conn.execute("INSERT INTO bank_branches VALUES ('17', 'VTB', '2021-01-16', 'batumi',  '13435225.10');")
conn.commit()
conn.close()

In [233]:
conn = sqlite3.connect('bank_branches.db')
cur = conn.cursor()
cur.execute("SELECT * from bank_branches;")
result = cur.fetchall()
conn.close()

result

[(13, 'BoG', '2020-09-20', 'tbilisi', 65874436.84),
 (15, 'TBC', '2020-11-06', 'tbilisi', 54780839.54),
 (17, 'VTB', '2021-01-16', 'batumi', 13435225.1)]

Задание 10. Удалите строку из колонки типа REAL (из пункта 8), в которой значение признака среднее (то есть не минимальное и не максимальное). Напрямую указывать значение из этой строки нельзя.

In [234]:
# Removing a row from column with a REAL type
# in which the value of the attribute is average
conn = sqlite3.connect('bank_branches.db')
conn.execute('''DELETE FROM bank_branches WHERE finance = (
             SELECT finance FROM bank_branches WHERE finance < (SELECT MAX(finance) FROM bank_branches) AND finance > (SELECT MIN(finance) FROM bank_branches)
             );''') #Selecting and deleting an attribute with an average value 
conn.commit()
conn.close()

In [235]:
conn = sqlite3.connect('bank_branches.db')
cur = conn.cursor()
cur.execute("SELECT * from bank_branches;")
result = cur.fetchall()
conn.close()

result

[(13, 'BoG', '2020-09-20', 'tbilisi', 65874436.84),
 (17, 'VTB', '2021-01-16', 'batumi', 13435225.1)]